app/views/picture_relations/_form.html.erb

	<%= form.fields_for :picture_relations do |picture_form| %>
	<% picture = Picture.find(picture_form.object.picture_id) %>
---
SELECT "pictures".* FROM "pictures" WHERE "pictures"."id" = ? LIMIT 1  [["id", 5]]