app/controllers/educations_controller.rb

SELECT "educations".* FROM "educations"
---
  def index
    @educations = Education.all

SELECT "educations".* FROM "educations" WHERE "educations"."id" = ? LIMIT 1  [["id", "3"]]
---
  def show
    @education = Education.find(params[:id])

SELECT "pictures".* FROM "pictures"
---
  def new
    @education = Education.new
    @pictures = Picture.all

SELECT "educations".* FROM "educations" WHERE "educations"."id" = ? LIMIT 1  [["id", "3"]]
---
  def edit
    @education = Education.find(params[:id])

SELECT "educations".* FROM "educations" WHERE "educations"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "educations" SET "start_date" = '2012-10-11', "end_date" = '2012-10-11', "updated_at" = '2012-10-11 22:30:30.469900' WHERE "educations"."id" = 3
---
  def update
    @education = Education.find(params[:id])

    respond_to do |format|
      if @education.update_attributes(params[:education])