app/controllers/experiences_controller.rb

  def index
    @experiences = Experience.all
---
SELECT "experiences".* FROM "experiences"

  def show
    @experience = Experience.find(params[:id])
---
SELECT "experiences".* FROM "experiences" WHERE "experiences"."id" = ? LIMIT 1  [["id", "2"]]

  def new
    @experience = Experience.new
    @pictures = Picture.all
---
SELECT "pictures".* FROM "pictures"

  def edit
    @experience = Experience.find(params[:id])
---
SELECT "experiences".* FROM "experiences" WHERE "experiences"."id" = ? LIMIT 1  [["id", "2"]]

  def create
    @experience = Experience.new(params[:experience])

    respond_to do |format|
      if @experience.save
---
INSERT INTO "experiences" ("compagny", "created_at", "description", "end_date", "keywords", "location", "position", "start_date", "updated_at", "website") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @experience = Experience.find(params[:id])

    respond_to do |format|
      if @experience.update_attributes(params[:experience])
---
SELECT "experiences".* FROM "experiences" WHERE "experiences"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "experiences" SET "location" = '', "description" = '-> Redaction de specifications fonctionnelles/techniques afin de developper un outil de tests sur Oracle BRM (Billing and Revenue Management).