app/controllers/home_controller.rb

  def index
    @profile = Profile.find(:first)
    if @profile.nil?
      @profile = Profile.new(:login => "Anon", :email => "anon@anon.anon", :password => "anon", :title => "Hi. I'm Anon, Welcome on my portfolio", :description => "My personal Description")
      @profile.save
    end
    @projects = Project.all.first(3)
---
INSERT INTO "profiles" ("created_at", "description", "email", "fb_link", "firstname", "git_link", "hobby", "lkdIn_link", "login", "name", "password_digest", "title", "twitter_link", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "projects".* FROM "projects"