app/controllers/pictures_controller.rb

  def create
    @picture = Picture.new(params[:picture])

    respond_to do |format|
      if @picture.save
---
INSERT INTO "pictures" ("created_at", "legend", "updated_at", "url") VALUES (?, ?, ?, ?)  [["created_at", Thu, 11 Oct 2012 15:34:07 UTC +00:00], ["legend", "sye_avatar"], ["updated_at", Thu, 11 Oct 2012 15:34:07 UTC +00:00], ["url", "avatar.jpg"]]

  def update
    @picture = Picture.find(params[:id])

    respond_to do |format|
      if @picture.update_attributes(params[:picture])
---
SELECT "pictures".* FROM "pictures" WHERE "pictures"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "pictures" SET "legend" = '[M2]Auto Concession', "updated_at" = '2012-10-11 15:36:08.252970' WHERE "pictures"."id" = 2