app/controllers/profiles_controller.rb

  def edit
    @profile = Profile.find(params[:id])
    @pictures = Picture.all
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "pictures".* FROM "pictures"

  def update
    @profile = Profile.find(params[:id])

    respond_to do |format|
      if @profile.update_attributes(params[:profile])
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "profiles" SET "name" = '', "firstname" = '', "password_digest" = '$2a$10$sMgz8oCUuMUtMu6m7xxw0e0nlbmw6noY/KeCx84xvawkdsg7tCDD.', "hobby" = '', "git_link" = '', "fb_link" = '', "twitter_link" = '', "lkdIn_link" = '', "updated_at" = '2012-10-12 13:03:42.470134' WHERE "profiles"."id" = 1