app/controllers/projects_controller.rb

SELECT "pictures".* FROM "pictures"
---
  def new
    @project = Project.new
    @pictures = Picture.all

INSERT INTO "projects" ("created_at", "description", "status", "technologies", "title", "updated_at", "website") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @project = Project.new(params[:project])

    respond_to do |format|
      if @project.save

SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "projects" SET "start_date" = '2012-10-11', "end_date" = '2012-10-11', "updated_at" = '2012-10-11 17:35:56.621121' WHERE "projects"."id" = 1
---
  def update
    @project = Project.find(params[:id])

    respond_to do |format|
      if @project.update_attributes(params[:project])